app/controllers/user_controller.rb

INSERT INTO `users` (`updated_at`, `country_of_origin`, `first_name`, `date_of_birth`, `last_name`, `password`, `sexe`, `email`, `created_at`) VALUES('2010-11-07 00:29:20', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-11-07 00:29:20')
---
  def register
    @user = User.new(params[:user])
    @user.save